import MethodologySection from "@/components/common/methodology-section/MethodologySection.tsx";
import List from "@/components/common/list/List.tsx";

function ExamplesClassroomAndHomeworkTasks() {
    return (
        <MethodologySection
            title={"Приклади аудиторних і домашніх задач"}
            id={"examplesClassroomAndHomeworkTasksPzOne"}
            isFirstSection={false}
        >
            <div className="mb-[40px]">
                <List type={"Text"}>
                    <li>1.5.1 Реалізуйте та доведіть коректність циклу обчислення
                        максимуму у одномірному масиві.
                    </li>
                    <li>1.5.2 Дано масив елементів, що приймають одне з двох
                        значень 1 і 2. Необхідно впорядкувати його так, щоб на
                        початку йшли всі 1, а потім все 2.
                        Реалізуйте це завдання, використовуючи один цикл і доведіть
                        коректність своєї реалізації з використанням варіанти,
                        інваріанти, перед і постумов циклу, індукції.
                    </li>
                    <li>1.5.3 Відсортуйте масив методом вставок. Доведіть
                        коректність своєї реалізації з використанням варіанти,
                        інваріанти, перед і постумов циклу, індукції.
                    </li>
                    <li>1.5.4 Знайти ітеративним способом факторіал натурального
                        числа N. Реалізуйте це завдання, використовуючи один цикл і
                        доведіть коректність своєї реалізації з використанням варіанти,
                        інваріанти, перед і постумов циклу, індукції.
                    </li>
                    <li>1.5.5 Знайти ітеративним способом N-е число Фібоначчі.
                        Реалізуйте це завдання, використовуючи один цикл і доведіть
                        коректність своєї реалізації з використанням варіанти,
                        інваріанти, перед і постумов циклу, індукції.
                    </li>
                    <li>1.5.6 Дано ціле число а і натуральне (ціле невід'ємне) число
                        n. Обчислити а в ступені n, якщо потрібно, щоб число дій
                        (виконуваних операторів присвоювання) було близько log n.
                        Реалізуйте це завдання, використовуючи один цикл і доведіть
                        коректність своєї реалізації з використанням варіанти,
                        інваріанти, перед і постумов циклу, індукції.
                    </li>
                    <li>1.5.7 Дано два натуральних числа a і b. Обчислити їх
                        найбільший спільний дільник. Реалізуйте це завдання,
                        використовуючи один цикл і доведіть коректність своєї
                        реалізації з використанням варіанти, інваріанти, перед і
                        постумов циклу, індукції.
                    </li>
                </List>
            </div>
        </MethodologySection>
    )
}

export default ExamplesClassroomAndHomeworkTasks;