function ScreenPlug() {
    return (
        <div className={'w-full pr-[30px] pl-[15px] pt-[30px]'}>
            <h3 className={"text-[40px] font-bold mb-[30px]"}>Формальні методи інженерії програмного забезпечення</h3>
            <p>
                Дисципліна направлена на засвоєння студентами
                основних формальних методів, що застосовуються
                задля моделювання, розробки та верифікації
                складних програмних продуктів, а саме створення
                формальної специфікації програмної системи,
                верифікації специфікацій шляхом доведення їх
                властивостей, реалізації системи на основі
                формальних перетворень специфікацій програм.
            </p>
        </div>
    );
}

export default ScreenPlug;